Repository: DABND19/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/entrypoint.po
Languages: ru

source: entrypoint
ru: Точка входа (`entrypoint`)

source: In the generic case, the entrypoint helper creates an event loop and cancels already running coroutines on exit.
ru: В общем случае точка входа это сущность помогающая создать event loop и закрыть все еще запущенные корутины при выходе.

source: Complete example:
ru: Пример целиком:

source: import asyncio import aiomisc import logging import signal async def main(): await asyncio.sleep(1) logging.info("Hello there") with aiomisc.entrypoint( pool_size=2, log_level='info', log_format='color', # default when "rich" absent log_buffer_size=1024, # default log_flush_interval=0.2, # default log_config=True, # default policy=asyncio.DefaultEventLoopPolicy(), # default debug=False, # default catch_signals=(signal.SIGINT, signal.SIGTERM), # default shutdown_timeout=60, # default ) as loop: loop.run_until_complete(main())
ru: import asyncio import aiomisc import logging async def main(): await asyncio.sleep(1) logging.info("Hello there") with aiomisc.entrypoint( pool_size=2, log_level='info', log_format='color', # по умолчанию если "rich" не установлен log_buffer_size=1024, # по умолчанию log_flush_interval=0.2, # по умолчанию log_config=True, # по умолчанию policy=asyncio.DefaultEventLoopPolicy(), # по умолчанию debug=False, # по умолчанию catch_signals=(signal.SIGINT, signal.SIGTERM), # по умолчанию shutdown_timeout=60, # по умолчанию ) as loop: loop.run_until_complete(main())

source: Running entrypoint from async code
ru: Запуск точки входа (`entrypoint`) из асинхронного кода

source: import asyncio import aiomisc import logging from aiomisc.service.periodic import PeriodicService log = logging.getLogger(__name__) class MyPeriodicService(PeriodicService): async def callback(self): log.info('Running periodic callback') # ... async def main(): service = MyPeriodicService(interval=1, delay=0) # once per minute # returns an entrypoint instance because event-loop # already running and might be get via asyncio.get_event_loop() async with aiomisc.entrypoint(service) as ep: try: await asyncio.wait_for(ep.closing(), timeout=1) except asyncio.TimeoutError: pass asyncio.run(main())
ru: import asyncio import aiomisc import logging from aiomisc.service.periodic import PeriodicService log = logging.getLogger(__name__) class MyPeriodicService(PeriodicService): async def callback(self): log.info('Running periodic callback') # ... async def main(): service = MyPeriodicService(interval=1, delay=0) # once per minute # вернет экземпляр entrypoint потому, что event-loop # уже запущен и может быть получен через asyncio.get_event_loop() async with aiomisc.entrypoint(service) as ep: try: await asyncio.wait_for(ep.closing(), timeout=1) except asyncio.TimeoutError: pass asyncio.run(main())

source: Dynamic running of services
ru: Динамический запуск сервисов

source: Sometimes it is not enough to add services to the entrypoint at the start, or it is not possible to get the service parameters before the start of the event-loop. In this case it is possible to start services after the event-loop has started, this feature available from version ``17``.
ru: Иногда бывает недостаточно добавить сервисы в точку входа на старте или нет возможности получить параметры сервиса до старта event-loop. В этом случае возможен запуск сервисов после запуска событийного цикла, эта функция доступна с версии ``17``.

source: Configuration from environment
ru: Конфигурация из переменных окружения

source: Module support configuration from environment variables:
ru: Модуль поддерживает конфигурацию из переменных окружения:

source: ``AIOMISC_LOG_LEVEL`` - default logging level
ru: ``AIOMISC_LOG_LEVEL`` - уровень логирования по умолчанию

source: ``AIOMISC_LOG_FORMAT`` - default log format
ru: ``AIOMISC_LOG_FORMAT`` - формат логирования по умолчанию

source: ``AIOMISC_LOG_DATE_FORMAT`` - default logging date format
ru: ``AIOMISC_LOG_DATE_FORMAT`` - формат дат в логах по умолчанию

source: ``AIOMISC_LOG_CONFIG`` - should logging be configured
ru: ``AIOMISC_LOG_CONFIG`` - следует ли настраивать логирование

source: ``AIOMISC_LOG_FLUSH`` - interval between logs flushing from buffer
ru: ``AIOMISC_LOG_FLUSH`` - интервал сброса буфера логов logs

source: ``AIOMISC_LOG_BUFFERING`` - should logging be buffered
ru: ``AIOMISC_LOG_BUFFERING`` - следует ли включать буфферизацию логирования

source: ``AIOMISC_LOG_BUFFER_SIZE`` - maximum log buffer size
ru: ``AIOMISC_LOG_BUFFER_SIZE`` - максимальный размер буфера логов

source: ``AIOMISC_POOL_SIZE`` - thread pool size
ru: ``AIOMISC_POOL_SIZE`` - размер пула потоков

source: ``AIOMISC_USE_UVLOOP`` - should use uvloop when it available, ``0`` to disable
ru: ``AIOMISC_USE_UVLOOP`` - следует ли использовать uvloop, ``0`` чтобы отключить

source: ``AIOMISC_SHUTDOWN_TIMEOUT`` - If, after receiving the signal, the program does not terminate within this timeout, a force-exit occurs.
ru: ``AIOMISC_SHUTDOWN_TIMEOUT`` - Если после получения сигнала программа не завершается в течение этого таймаута, происходит принудительный выход.

source: ``run()`` shortcut
ru: Функция ``run()``

source: ``aiomisc.run()`` - it's the short way to create and destroy ``aiomisc.entrypoint``. It's very similar to ``asyncio.run()`` but handle ``Service``'s and other ``entrypoint``'s kwargs.
ru: ``aiomisc.run()`` - это простой способ создать и разрушить ``aiomisc.entrypoint``. Это очень похоже на ``asyncio.run()`` но управляет сервисами ``aiomisc.Service`` и принимает прочие аргументы entrypoint.

source: Logging configuration
ru: Конфигурация журналов

source: ``entrypoint`` accepts ``log_format`` argument with a specific set of formats, in which logs will be written to stderr:
ru: ``entrypoint`` принимает аргумент ``log_format`` с определенным набором форматов, в которых журналы будут записываться в stderr.

source: ``stream`` - Python's default logging handler
ru: ``stream`` - стандартный python логгер

source: ``color`` - logging with `colorlog` module
ru: ``color`` - логирование через модуль ``colorlog``

source: ``json`` - json structure per each line
ru: ``json`` - json структура, одна на строчку

source: ``syslog`` - logging using stdlib `logging.handlers.SysLogHandler`
ru: ``syslog`` - ``logging.handlers.SysLogHandler`` из стандартной библиотеки

source: ``plain`` - just log messages, without date or level info
ru: ``plain`` - просто сообщения, без даты или информации об уровне логирования

source: ``journald`` - available only when `logging-journald` module has been installed.
ru: ``journald`` - доступно только если ``logging-journald`` модуль установлен.

source: ``rich``/``rich_tb`` - available only when `rich` module has been installed. ``rich_tb`` it's the same as ``rich`` but with fully expanded tracebacks.
ru: ``rich``/``rich_tb`` - доступно только если установлен модуль ``rich``. ``rich_tb`` тоже самое что и ``rich`` только с подробными трейсбэками.

source: Additionally, you can specify log level using ``log_level`` argument and date format using ``log_date_format`` parameters.
ru: Также вы можете настроить уровень логирования параметром ``log_level`` и формат дат в логах параметром ``log_date_format``

source: An ``entrypoint`` will call ``aiomisc.log.basic_config`` function implicitly using passed ``log_*`` parameters. Alternatively you can call ``aiomisc.log.basic_config`` function manually passing it already created eventloop.
ru: ``entrypoint`` вызовет ``aiomisc.log.basic_config`` неявно используя пеараметры ``log_*=``. В качестве альтернативы, вы можете вызвать ``aiomisc.log.basic_config`` вручную передав ей экземпляр ``eventloop``.

source: However, you can configure logging earlier using ``aiomisc_log.basic_config``, but you will lose log buffering and flushing in a separate thread. This function is what is actually called during the logging configuration, the ``entrypoint`` passes a wrapper for the handler there to flush it into the separate thread.
ru: Однако вы можете настроить логирование раньше, используя ``aiomisc_log.basic_config``, но вы потеряете буферизацию и запись в буфер отдельном потоке. Эта функция фактически вызывается во время настройки ведения журнала, ``entrypoint`` передает обертку для logging handler, чтобы он записывал в буфер в отдельном потоке.

source: If you want to configure logging before the ``entrypoint`` is started, for example after the arguments parsing, it is safe to configure it twice (or more).
ru: Если вы хотите настроить ведение журнала перед запуском ``entrypoint``, например, после разбора аргументов, это безопасно настроить его дважды (или больше).

source: Sometimes you want to configure logging manually, the following example demonstrates how to do this:
ru: Иногда вы хотите настроить ведение журнала самостоятельно, пример ниже демонстрирует, как это сделать:

source: import os import logging from logging.handlers import RotatingFileHandler from gzip import GzipFile import aiomisc class GzipLogFile(GzipFile): def write(self, data) -> int: if isinstance(data, str): data = data.encode() return super().write(data) class RotatingGzipFileHandler(RotatingFileHandler): """ Really added just for example you have to test it properly """ def shouldRollover(self, record): if not os.path.isfile(self.baseFilename): return False if self.stream is None: self.stream = self._open() return 0 < self.maxBytes < os.stat(self.baseFilename).st_size def _open(self): return GzipLogFile(filename=self.baseFilename, mode=self.mode) async def main(): for _ in range(1_000): logging.info("Hello world") with aiomisc.entrypoint(log_config=False) as loop: gzip_handler = RotatingGzipFileHandler( "app.log.gz", # Maximum 100 files by 10 megabytes maxBytes=10 * 2 ** 20, backupCount=100 ) stream_handler = logging.StreamHandler() formatter = logging.Formatter( "[%(asctime)s] <%(levelname)s> " "%(filename)s:%(lineno)d (%(threadName)s): %(message)s" ) gzip_handler.setFormatter(formatter) stream_handler.setFormatter(formatter) logging.basicConfig( level=logging.INFO, # Wrapping all handlers in separate streams will not block the # event-loop even if gzip takes a long time to open the # file. handlers=map( aiomisc.log.wrap_logging_handler, (gzip_handler, stream_handler) ) ) loop.run_until_complete(main())
ru: import os import logging from logging.handlers import RotatingFileHandler from gzip import GzipFile import aiomisc class GzipLogFile(GzipFile): def write(self, data) -> int: if isinstance(data, str): data = data.encode() return super().write(data) class RotatingGzipFileHandler(RotatingFileHandler): """ Really added just for example you have to test it properly """ def shouldRollover(self, record): if not os.path.isfile(self.baseFilename): return False if self.stream is None: self.stream = self._open() return 0 < self.maxBytes < os.stat(self.baseFilename).st_size def _open(self): return GzipLogFile(filename=self.baseFilename, mode=self.mode) async def main(): for _ in range(1_000): logging.info("Hello world") with aiomisc.entrypoint(log_config=False) as loop: gzip_handler = RotatingGzipFileHandler( "app.log.gz", # Максимум 100 файлов по 10 мегабайт maxBytes=10 * 2 ** 20, backupCount=100 ) stream_handler = logging.StreamHandler() formatter = logging.Formatter( "[%(asctime)s] <%(levelname)s> " "%(filename)s:%(lineno)d (%(threadName)s): %(message)s" ) gzip_handler.setFormatter(formatter) stream_handler.setFormatter(formatter) logging.basicConfig( level=logging.INFO, # Обертывание всех обработчиков в отдельные потоки не заблокирует # event-loop даже если gzip занимает много времени, чтобы открыть # файл. handlers=map( aiomisc.log.wrap_logging_handler, (gzip_handler, stream_handler) ) ) loop.run_until_complete(main())
